<?php

/**
 * ============================================================================
 * 源码科技聚会小游戏
 * 版权所有: 	2018-2066 北京猿马网络技术有限公司，并保留所有权利。
 * 作者:		宋占弟
 * 联系QQ:	1029134683
 * Date: 	2019/1/16
 * Time: 	15:39
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！未经本公司授权您只能在不用于商业目的的前提下对程序代码进行修改和使用；
 * 不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * 登陆规则
 */

namespace app\admin\validate;

use think\Validate;

class DoLogin extends Validate
{

	protected $rule = [
			'username'  => 'require|regex:/^1[34578]\d{9}$/',
			'password'  => 'require|regex:/^[a-zA-Z0-9_-]{6,10}$/',
		];

	protected $message = [
			'username.require' 	=> '用户不能为空',
			'username.regex'  	=> '请输入正确的手机号',
			'password.require'  => '密码不能为空',
			'password.regex'  	=> '密码由6-10位的数字、字母、下划线组成',
		];
}
